![png](Data/Books_core.png)

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

# for more complex passwords
from urllib.parse import quote_plus as urlquote
from sqlalchemy_utils import database_exists, create_database

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'root' # whatever password you chose during MySQL installation.

connection = "mysql+pymysql://root:root@localhost/Books-core"
engine = create_engine(connection)

In [2]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [3]:
import pandas as pd
df = pd.read_csv('data/data1.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [4]:
df.to_sql('user', engine, if_exists = 'replace')

3

In [5]:
df2 = pd.read_csv('data/data2.csv')
df2.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [6]:
df2.to_sql('books', engine, if_exists = 'replace')

6

In [7]:
df3 = pd.read_csv('data/data3.csv')
df3.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [8]:
df3.to_sql('authors', engine, if_exists = 'replace')

5

In [9]:
df4 = pd.read_csv('data/data4.csv')
df4.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [10]:
df4.to_sql('favorites', engine, if_exists = 'replace')

7

In [11]:
q = '''SHOW TABLES;'''
pd.read_sql(q,engine)

  Tables_in_books-core
0              authors
1                books
2            favorites
3                 user

In [19]:
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT user.id FROM user WHERE (user.last_name = "Doe" AND user.first_name = "John"));

SyntaxError: invalid syntax (1590973046.py, line 1)